--liquibase formatted sql

--changeset VolginTA: test_data context:demo
INSERT INTO orders (id, created, email, phone, note, address, user_id, username)
VALUES (1, '2023-10-10 23:00:00', 'test1@email.ru', '+7(991) 999-99-11', 'Заметка 1', 'г Обнинск' , '3c9dd655-85ba-4760-bd89-a676e16264ae', 'Иван'),
       (2, '2023-07-10 23:00:00', 'test2@email.ru', '+7(992) 999-99-22', 'Заметка 2', 'г Обнинск', '132eb191-2e7b-4ea2-8871-e3f295c4c63e', 'Владимир'),
       (3, '2023-11-10 23:00:00', 'test3@email.ru', '+7(993) 999-99-33', 'Заметка 3', 'г Обнинск', '36c7648d-1e1f-4dfb-9242-93eaf831c870', 'Павел'),
       (4, '2023-09-10 23:00:00', 'test4@email.ru', '+7(994) 999-99-44', 'Заметка 4', 'г Москва', '36c7648d-1e1f-4dfb-9242-93eaf831c870', 'Павел'),
       (5, '2023-09-10 23:00:00', 'test5@email.ru', '+7(995) 999-99-55', 'Заметка 5', 'г Обнинск', '36c7648d-1e1f-4dfb-9242-93eaf831c870', 'Сергей');
ALTER TABLE orders
    ALTER COLUMN id RESTART WITH 6;

INSERT INTO order_items (order_id, product_id, description, price, count)
VALUES (1, 1, 'Книга Руслан и Людмила', 350.00, 1),
       (1, 2, 'Книга Пиковая дама', 200.00, 2),
       (2, 3, 'Книга Евгений Онегин', 300.00, 3),
       (2, 4, 'Книга Бородино', 150.00, 1),
       (2, 5, 'Книга Герой нашего времени', 200.00, 2),
       (3, 6, 'Книга Царь Борис', 200.00, 3),
       (3, 7, 'Книга Смерть Иоанна Грозного', 200.00, 1),
       (4, 8, 'Избранные сочинения Пушкина', 1000.00, 1),
       (5, 9, 'Избранные сочинения Толстого', 700.00, 1),
       (5, 10, 'Избранные сочинения Лермонтова', 500.00, 1);
